src/Catalogs/ГруппыУчастников/ГруппыУчастников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыУчастников</name>
</mdclass:Catalog>

src/InformationRegisters/УчастникиВГруппах/УчастникиВГруппах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиВГруппах</name>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ГруппыУчастников/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	нзГруппыУчастников=РегистрыСведений.УчастникиВГруппах.СоздатьНаборЗаписей();
	нзГруппыУчастников.Отбор.Группа.Значение=Объект.Ссылка;
	нзГруппыУчастников.Отбор.Группа.Использование=Истина;
	нзГруппыУчастников.Прочитать();
	ЗначениеВДанныеФормы(нзГруппыУчастников,ГруппыУчастников);
КонецПроцедуры


&НаКлиенте
Процедура ГруппыУчастниковПриИзменении(Элемент)
	Элемент.ТекущиеДанные.Группа=Объект.Ссылка;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	нзГруппыУчастников=РегистрыСведений.УчастникиВГруппах.СоздатьНаборЗаписей();
	нзГруппыУчастников=ДанныеФормыВЗначение(ГруппыУчастников,Тип("регистрсведенийнаборзаписей.участникивгруппах"));
	нзГруппыУчастников.Записать();
КонецПроцедуры
